<template>
	<transition name="popup" v-on:enter="onEnter" v-on:leave="onLeave">
		<div class="rules df-popup" v-show="isOpened">
			<div class="df-popup__wrap" @click.self="closeRules">
				<div class="rules__center df-popup__center">
					<a href="#" @click.prevent="closeRules" class="rules__close df-popup__close">
						<svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
							<rect y="14.5454" width="20.5702" height="2.05702" transform="rotate(-45 0 14.5454)"/>
							<rect x="1.45459" width="20.5702" height="2.05702" transform="rotate(45 1.45459 0)"/>
						</svg>
					</a>
					<h3 class="rules__title">Правила обработки персональных данных</h3>
					<div class="rules__left df-text-main-16px">
						<p>
							Заполняя Анкету и/или отправляя резюме на указанный адрес эл. почты я в соответствии со статьей 9 Федерального закона от 27 июля 2006 года №152-ФЗ «О защите персональных данных» своей волей, свободно и в своем интересе даю согласие ООО «ХММР» (место нахождения: 197701, Санкт-Петербург, г. Сестрорецк, Левашовское шоссе, д. 20, стр. 1) на обработку своих персональных данных, содержащихся в настоящей Анкете и/или в резюме, без использования средств автоматизации и (или) с использованием таких средств в целях рассмотрения возможности моего трудоустройства в ООО «ХММР», содействия в трудоустройстве, проверки сведений, указанных мною в Анкете и/или в резюме, хранения и систематизации сведений обо мне во внутренней базе данных кандидатов на вакансии в ООО «ХММР», а также в целях соблюдения действующего законодательства. Я даю согласие на осуществление ООО «ХММР» следующих действий (операций) в отношении указанных мною персональных данных, включая без ограничения: получение, запись (в том числе видеозапись), накопление, хранение, систематизацию, комбинирование, извлечение, уточнение (обновление, изменение), использование, передачу, включая трансграничную передачу на территории иностранных государств, третьим лицам, блокирование, обезличивание, удаление, уничтожение, а также осуществление любых иных действий с персональными данными с учетом требований действующего законодательства Российской Федерации.
						</p>
					</div>
					<div class="rules__right df-text-main-16px">
						<p>
							Согласие распространяется также на обработку моих персональных данных, полученных ООО «ХММР» до момента дачи такого согласия. Согласие действует в течение 15 (пятнадцати) лет, если в отношении определенных персональных данных действующим законодательством Российской Федерации не предусмотрены иные сроки обработки. Согласие может быть отозвано при предоставлении ООО «ХММР» заявления в простой письменной форме в соответствии с требованиями законодательства Российской Федерации не позднее, чем за 1 месяц до момента отзыва согласия. ООО «ХММР» имеет право проверить достоверность персональных данных, указанных в настоящей Анкете и/или резюме, в том числе, с привлечением третьих лиц. Заполнение настоящей Анкеты и/или отправка резюме на указанный адрес эл. почты не является заключением трудового договора и не гарантирует трудоустройство в ООО «ХММР»
						</p>
						<p>
							Данный адрес эл. почты предназначен исключительно для отправки резюме в целях рассмотрения возможности трудоустройства в ООО «ХММР» и не может быть использован для отправки иных обращений любого характера. ООО «ХММР» не несет ответственность за любые последствия, связанные с отправкой обращений на указанный адрес эл. почты, не связанных с целью отправки резюме.
						</p>
					</div>
				</div>
			</div>
		</div>
	</transition>
</template>

<script>
export default {
  name: "Rules",
  components: {},
  props: ['isOpened'],
  data() {
    return {

	};
  },
  computed: {

  },
  methods: {
	  closeRules: function () {
		  if (typeof this.$store.state.openRules !== 'undefined') {
			  this.$store.dispatch('OPEN_RULES', false);
		  }
		  this.$emit('close');
	  },
	  onEnter: function() {
			this.$root.$emit('fixOverflow', true)
	  },
	  onLeave: function() {
			this.$root.$emit('fixOverflow', false)
	  }
  },
  filters: {},
  mounted() {
	var that = this;

	this.$nextTick(function() {

	})
  },
  watch: {}
};
</script>

<style lang="sass">
@import '../../../../sass/common/_variables.scss'
@import '../../../../sass/common/components/_rules.sass'
</style>
